agenticaiuw/hivemind/firmware/nrf9160/src/main.c
#define SD_MOUNT_POINT "/SD:"
#define SD_RECORDING_PATH SD_MOUNT_POINT "/latest.pcm"
#define SD_OPUS_PATH SD_MOUNT_POINT "/latest.opus"
#define SD_SELFTEST_PCM_PATH SD_MOUNT_POINT "/selftest.pcm"
#define SD_SELFTEST_OPUS_PATH SD_MOUNT_POINT "/selftest.opus"
#define SD_TEST_PATH SD_MOUNT_POINT "/power_test.bin"
#define SD_TEST_MAGIC 0x53445631U
#define SD_TEST_CHECK_XOR 0xA55A39C3U

/* Boot upload stresses encode+LTE at once; keep off for stable bring-up. */
#define PENDANT_BOOT_UPLOAD_EXISTING 0
/* Temporary diagnostic: record five seconds automatically before LTE init. */
#define PENDANT_BOOT_AUTORECORD_TEST 0
/* Temporary diagnostic: exercise one complete post-LTE voice cycle. */
#define PENDANT_BOOT_AUDIO_CYCLE_TEST 0
/*
 * Stack self-test: encode a synthetic strongly voiced tone at boot.
 *
 * The deepest libopus stack path is silk_pitch_analysis_core's stage-3
 * contour search, and its two 1920-byte VLAs sit behind the "a pitch
 * candidate was found" branch - a silent or noise-only recording returns
 * early and never touches them, so it cannot validate the stack budget.
 * A 125 Hz sawtooth is unambiguously voiced and forces that branch, which
 * makes the high-water number printed afterwards meaningful.  Needs no
 * microphone, no button and no network.  Leave at 0; set to 1 to re-measure
 * after touching CONFIG_MAIN_STACK_SIZE, the opus complexity setting, or
 * OPUS_FRAME_MS.
 *
 * Last measured on hardware: peak=25396 of 32768 bytes, 7372 free.
 */
#define PENDANT_BOOT_ENCODE_SELFTEST 0
#define SELFTEST_PITCH_PERIOD_SAMPLES 125U
#define SELFTEST_AMPLITUDE 9000
#define SELFTEST_SECONDS 3U
/* Temporary diagnostic: emit the saved raw PCM as delimited hex on USB. */
#define PENDANT_BOOT_DUMP_PCM_HEX 0
/* Temporary diagnostic: prove whether the microphone actively drives DOUT. */
#define PENDANT_MIC_ELECTRICAL_PROBE 0
/*
 * Hardware self-test: start a duplex conversation automatically N seconds
 * after boot and end it after PENDANT_BOOT_CONVERSATION_SECONDS. Set to 1
 * to validate the whole duplex path (I2S both directions, live Opus encode
 * + decode, WebSocket, relay, ESP32) from the serial log alone — no button
 * press required. Leave at 0 for normal use.
 */
#define PENDANT_BOOT_CONVERSATION_TEST 0
#define PENDANT_BOOT_CONVERSATION_SECONDS 30U

/*
 * ---- Full-duplex conversation (WebSocket transport) ----
 *
 * One I2S config drives BOTH directions (i2s_nrfx memcmps them): the mic's
 * proven 24-bit/mono/slave/31250 setup, clocks from the PWM loopback. RX is
 * byte-identical to record_microphone's capture; TX rides the same clocks
 * out SDOUT to the ESP32, which reads the top 16 bits of each 24-bit left
 * word (TX word = sample << 8) at 31250 frames/s.
 *
 * Downlink Opus decodes at the 16 kHz wire rate; the TX fill upsamples
 * 16000 → 31250 with exact 64/125 phase math. TX must NEVER starve: an
 * nrfx TX underrun errors the whole duplex transfer, RX included, so the
 * fill emits silence whenever the jitter ring is below its gate.
 */
#define CONVO_MAX_SECONDS 300U
#define CONVO_TX_BLOCK_FRAMES MIC_RX_BLOCK_FRAMES
/*
 * TX runway. i2s_nrfx latches 2 buffers in hardware and holds the rest in
 * tx_queue (CONFIG_I2S_NRFX_TX_BLOCK_COUNT). It asks for the next TX buffer
 * in the SAME ISR that completes an RX block, and if that buffer is still
 * missing one block later it declares "Next buffers not supplied on time"
 * and kills the WHOLE duplex transfer, RX included (i2s_nrfx.c:194-203).
 *
 * A 1:1 write-per-read loop therefore runs with ZERO slack and dies on the
 * first 20 ms hiccup — that is exactly what killed conversations on
 * hardware after 1-3.5 s. Instead the loop keeps this queue topped up, so
 * the transfer survives a stall as long as the runway below.
 * 8 queued + 2 latched = 10 blocks = 205 ms, matching the RX slab's depth.
 */
#define CONVO_TX_QUEUE_BLOCKS 8U
#define CONVO_TX_SLAB_BLOCKS (CONVO_TX_QUEUE_BLOCKS + 2U)
/* Fill the runway before START so the first seconds have slack too. */
#define CONVO_TX_PRIME_BLOCKS 6U
/*
 * Decode budget per RX block. RX blocks arrive at 31250/640 = 48.8 Hz, so
 * a cap of N sets a hard ceiling of 48.8*N decoded packets per second. At
 * 60 ms reply frames the stream needs 16.7/s, so 2 leaves ~6x headroom to
 * catch up after a burst. This ceiling is easy to set below the required
 * rate by accident: at 20 ms frames the stream needs 50/s, which a cap of
 * 1 could never meet, and playback starved continuously.
 */
#define CONVO_MAX_DECODES_PER_BLOCK 2U
/* 24 kHz s16 jitter ring: 512 ms of agent speech. Barge-in flushes it, so
 * depth buys LTE-jitter absorption, not conversational latency. */
#define DL_JITTER_BYTES 24576U
#define DL_JITTER_SAMPLES (DL_JITTER_BYTES / sizeof(int16_t))
/*
 * Start/resume playback only with this much banked (200 ms at 24 kHz).
 * Every starve pauses output and re-arms, which is audible as chopping —
 * hardware runs showed 8 of them in 22 s at the old 128 ms gate.
 */
#define DL_PREBUFFER_SAMPLES 4800U
/*
 * Worst case one downlink WS frame decodes to: the relay caps frames at 4
 * packets AND 500 B, each packet 60 ms (1440 samples at 24 kHz). The
 * receive gate needs at least this much ring space free, and the ring must
 * clear DL_PREBUFFER_SAMPLES afterwards or the prebuffer could never fill.
 * 2 packets x 60 ms x 24 kHz = 2880 samples.
 */
#define DL_WORST_FRAME_SAMPLES 2880U
BUILD_ASSERT(DL_JITTER_SAMPLES - DL_WORST_FRAME_SAMPLES >=
		     DL_PREBUFFER_SAMPLES + 1440U,
	     "receive gate must clear the prebuffer with a packet to spare");
/* Largest downlink WS frame the relay may send (packet-aligned, ≤500 B). */
#define WS_RX_BUF_BYTES 640U
/* ~120 ms of Opus per uplink frame: batching overhead vs VAD latency. */
#define WS_TX_BATCH_BYTES 240U
/*
 * ---- Adaptive duplex uplink ----
 *
 * LTE-M Cat-M1 is half-duplex. While the agent's reply streams down, the modem
 * cannot transmit, so the uplink FIFO fills at the encoder's rate and drains at
 * roughly zero. A live 42 s conversation ended with fifo_left=7146 — the 7 KiB
 * ring 100% full — uplink_drops=388, and "WS send failed: -116" nine seconds
 * later. The user's follow-up question was encoded straight into a full ring
 * and discarded by live_opus_packet_sink, so the agent never answered it while
 * the LED went right on blinking.
 *
 * Two levers, engaged only while downlink audio is playing:
 *
 *   DUCK - halve the uplink Opus target bitrate. The mic stream stays
 *          continuous, so server-side barge-in still sees the user, but the
 *          ring fills half as fast: the runway grows from ~3.5 s to ~7 s,
 *          which covers a typical agent utterance.
 *   HOLD - past the high-water mark, stop feeding the encoder at all. The
 *          packet would have been discarded by the sink anyway, so the splice
 *          in the uplink stream is identical and the measured ~15 ms encode is
 *          saved. What it actually buys is the reserve *below* the mark: when
 *          the agent stops talking the ring still has room for the user's next
 *          words, instead of the zero headroom the failing call ended with.
 *
 * Pausing capture outright was the other option in the proposal and is wrong
 * here: barge-in is server-side, so a muted uplink makes the agent
 * uninterruptible. Ducking degrades that path instead of removing it.
 */
#define CONVO_UPLINK_DUCK_BPS (PENDANT_OPUS_BITRATE / 2U)
/*
 * Downlink frames arrive in bursts and the jitter ring briefly empties between
 * them; without a hangover the duck would chatter the encoder every block.
 */
#define CONVO_DL_ACTIVE_HANGOVER_MS 300
/* Hold above 60% of the ring, release below 40%: the top ~2.8 KiB (≈1.4 s at
 * full rate) stays reserved for speech that arrives after the agent stops. */
#define CONVO_UPLINK_HOLD_BYTES ((OPUS_TX_FIFO_BYTES * 3U) / 5U)
#define CONVO_UPLINK_RESUME_BYTES ((OPUS_TX_FIFO_BYTES * 2U) / 5U)
BUILD_ASSERT(CONVO_UPLINK_RESUME_BYTES < CONVO_UPLINK_HOLD_BYTES,
	     "uplink hold needs hysteresis or it toggles every block");
/* Exact 24000/31250 ratio for the TX upsampler (96/125). */
#define TX_RESAMPLE_NUM 96U
#define TX_RESAMPLE_DEN 125U
/* Idle keepalive: under Cloudflare's 100 s WS idle kill. */
#define WS_IDLE_PING_SECONDS 25U

/* Decoder state arena (18,404 B measured + margin) — concurrent with the
 * encoder in audio_workspace, so it cannot time-share that block. */
static uint8_t opus_dec_arena[18432] __aligned(4);
/*
 * Downlink jitter ring — SPSC across threads: main decodes into it (owns
 * head), the audio thread drains it into I2S (owns tail). Fill is derived
 * from the two indices, never a shared counter.
 */
static int16_t dl_jitter[DL_JITTER_SAMPLES];
static volatile size_t dl_jitter_head;
static volatile size_t dl_jitter_tail;
static int16_t dl_decode_buf[1440]; /* one 60 ms wire packet at 24 kHz */

