agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * 4096 mu-law frames = 4,096 B = 262.14 ms at SAMPLE_RATE 15625, against a
 * 32.77 ms stage period: eight stages of runway, versus a worst observed host
 * stall of 114 ms.  The host keeps the ring topped up rather than draining it
 * to a low-water mark, so the whole 262 ms is available as insurance — see
 * software/ai-pendant-simulator/scripts/inject-audio.mjs.
 *
 * 4,096 B is the size RAM permits, not a size chosen for comfort.  This image
 * had 202,700 of 211,608 B spoken for (95.79%) before the ring existed; the
 * ring plus 24 B of control words takes it to 206,820 B (97.74%), leaving
 * 4,788 B.  Doubling it again would not link.  pendant_inject_underruns is
 * what tells you whether it was enough, which is why it is reported rather
 * than merely counted.
 */
volatile uint8_t pendant_inject_ring[PENDANT_INJECT_RING_FRAMES] __aligned(4);
/* Host writes: 1 = replace mic audio with the ring. */
volatile uint32_t pendant_inject_arm;
/* Host writes: producer index, in frames, free-running mod the ring size. */
volatile uint32_t pendant_inject_head;
/* Firmware writes: consumer index. The host reads it to compute free space. */
volatile uint32_t pendant_inject_tail;
/* Host writes: the utterance is fully queued; a dry ring is no longer a bug. */
volatile uint32_t pendant_inject_eof;
/* Firmware writes: stages that went out short because the host fell behind. */
volatile uint32_t pendant_inject_underruns;
/* Firmware writes: frames actually substituted into the uplink. */
volatile uint32_t pendant_inject_frames;

/*
 * Overwrite one staged mic block with injected PCM. Returns false when
 * injection is not armed, in which case the caller's real mic samples stand.
 */
static bool pendant_inject_fill_stage(int16_t *samples, size_t frame_count)
{
	if (pendant_inject_arm == 0U) {
		return false;
	}

	uint32_t tail = pendant_inject_tail;
	uint32_t fill = (pendant_inject_head - tail) & PENDANT_INJECT_RING_MASK;
	size_t take = MIN((size_t)fill, frame_count);

	for (size_t i = 0U; i < take; ++i) {
		samples[i] = ulaw_to_linear(
			pendant_inject_ring[(tail + i) &
					    PENDANT_INJECT_RING_MASK]);
	}
	/* Samples are consumed before the tail moves, so the host never
	 * overwrites a frame this stage is still reading. */
	compiler_barrier();
	pendant_inject_tail = (tail + (uint32_t)take) &
			      PENDANT_INJECT_RING_MASK;
	pendant_inject_frames += (uint32_t)take;

	if (take < frame_count) {
		/*
		 * Pad with digital silence rather than the live mic. Letting
		 * real audio back in on a starved stage would quietly restore
		 * the acoustic coupling this whole path exists to remove, and
		 * the run would look fine while measuring the wrong thing.
		 */
		memset(&samples[take], 0,
		       (frame_count - take) * sizeof(int16_t));
		if (pendant_inject_eof == 0U) {
			++pendant_inject_underruns;
		}
	}
	return true;
}

/*
 * Injection health rides in the existing "Conversation stats:" line rather
 * than a line of its own: a starved ring produces silence, silence looks
 * exactly like a working run that had nothing to say, and the number that
 * distinguishes them has to be where someone reading the run will see it.
 */
#define PENDANT_INJECT_STATS_FMT \
	" inject_frames=%u inject_underruns=%u"
#define PENDANT_INJECT_STATS_ARGS \
	, pendant_inject_frames, pendant_inject_underruns
#else
static inline bool pendant_inject_fill_stage(int16_t *samples,
					     size_t frame_count)
{
	ARG_UNUSED(samples);
	ARG_UNUSED(frame_count);
	return false;
}
#define PENDANT_INJECT_STATS_FMT ""
#define PENDANT_INJECT_STATS_ARGS
#endif /* CONFIG_PENDANT_MIC_INJECT */

static void clear_button_events(void)
{
	while (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
	}
}

static void finish_button_press(void)
{
	/* gpio_pin_get_dt() returns the logical active state. */
	while (gpio_pin_get_dt(&button) > 0) {
		k_msleep(5);
	}
	k_msleep(15);
	clear_button_events();
}

static bool consume_button_event(void)
{
	if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
		finish_button_press();
		return true;
	}
	return false;
}

static void wait_for_button_press(void)
{
	/*
	 * Latency-first: start work on the active edge. Do not wait for the
	 * physical release — that used to add hundreds of ms before the mic
	 * even powered up.
	 *
	 * While idle, wake every 5 s to check the half-open live stream. With
	 * STREAM_MAX_IDLE_MS at 12 s this refreshes on every third wake (~15 s
	 * cadence): sockets are rebuilt before Cloudflare's ~20 s idle kill but
	 * NOT unconditionally on every wake — the wake period must stay below
	 * the idle threshold or every wake tears down TLS + a Realtime session.
	 */
	while (k_sem_take(&button_press_sem, K_SECONDS(5)) != 0) {
		(void)pendant_cloud_stream_prewarm(PENDANT_OPUS_SAMPLE_RATE);
	}
	clear_button_events();
}

static void flash_led(unsigned int count, int on_ms, int off_ms)
{
	for (unsigned int flash = 0U; flash < count; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(on_ms);
		gpio_pin_set_dt(&led, 0);
		k_msleep(off_ms);
	}
}

/*
 * Solid LED = first speech batch on device (may still be downloading more).
 * Never autoplay — button 1 starts I2S → ESP32 → Bose.
 */
void pendant_notify_reply_first_batch(void)
{
	gpio_pin_set_dt(&led, 1);
	printk("First speech batch ready — solid LED; press button 1 to play "
	       "(no autoplay; download may still be finishing)\n");
}

static void wait_for_reply_playback_press(void)
{
	/* LED may already be solid from pendant_notify_reply_first_batch(). */
	if (!pendant_cloud_reply_first_batch) {
		gpio_pin_set_dt(&led, 1);
		printk("Reply complete — solid LED; press button 1 to play "
		       "(no autoplay)\n");
	} else {
		printk("Waiting for play press (LED already solid from first "
		       "speech batch)\n");
	}
	wait_for_button_press();
}

static int mount_sd_card(void)
{
	int error = -EIO;

	for (unsigned int attempt = 0U; attempt < 5U; ++attempt) {
		error = fs_mount(&sd_mount);
		if (error == 0) {
			break;
		}
		k_msleep(200);
	}
	sd_mount_result = error;
	sd_ready = error == 0;
	return error;
}

static int dump_sd_recording_hex(void)
{
	static const char digits[] = "0123456789abcdef";
	struct fs_file_t file;
	uint8_t bytes[48];
	char line[sizeof(bytes) * 2U + 1U];
	uint32_t total = 0U;
	int error;

