agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		for (;;) {
			read_result =
				pendant_cloud_reply_read(mono, sizeof(mono));
			if (read_result <= 0) {
				break;
			}
			if ((read_result & 1) != 0) {
				--read_result;
				if (read_result == 0) {
					break;
				}
			}

			size_t frames = (size_t)read_result / sizeof(int16_t);
			void *block;
			int16_t *output;

			if (!configured) {
				error = i2s_configure(i2s, I2S_DIR_TX, &config);
				if (error == 0) {
					error = queue_i2s_stream_preamble(i2s);
				}
				if (error != 0) {
					break;
				}
				configured = true;
				started = false;
				queued_blocks = I2S_SYNC_PATTERN_BLOCKS + 1U;
			}
			error = k_mem_slab_alloc(&i2s_slab, &block, K_MSEC(3000));
			if (error != 0) {
				break;
			}
			output = block;
			for (size_t frame = 0U; frame < frames; ++frame) {
				output[2U * frame] = mono[frame];
				output[2U * frame + 1U] = mono[frame];
			}
			for (size_t frame = frames; frame < I2S_BLOCK_FRAMES;
			     ++frame) {
				output[2U * frame] = 0;
				output[2U * frame + 1U] = 0;
			}
			error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
			if (error != 0) {
				k_mem_slab_free(&i2s_slab, block);
				if (++recoveries > INLINE_REPLY_MAX_RECOVERIES) {
					break;
				}
				printk("Inline reply I2S recovery %u (error %d)\n",
				       recoveries, error);
				(void)i2s_trigger(i2s, I2S_DIR_TX,
						  I2S_TRIGGER_DROP);
				configured = false;
				error = 0;
				continue;
			}
			played_samples += (uint32_t)frames;
			++queued_blocks;
			if (!started && queued_blocks >= I2S_PREFILL_BLOCKS) {
				error = i2s_trigger(i2s, I2S_DIR_TX,
						    I2S_TRIGGER_START);
				if (error != 0) {
					break;
				}
				started = true;
			}
		}
		goto teardown;
	}

	/*
	 * Streamed reply (Opus packets or u-law bytes) with a workspace jitter
	 * ring: LTE delivers in bursts with multi-second gaps, far larger than
	 * the 4-block (~43 ms) I2S queue. Prebuffer, then absorb; genuine
	 * starvation pauses cleanly and rebuffers with an escalating floor.
	 */
	{
		uint8_t *ring = audio_workspace;
		size_t ring_capacity = sizeof(audio_workspace);
		size_t ring_tail = 0U;
		size_t ring_head = 0U;
		size_t ring_count = 0U;
		/* Decoded-PCM staging: Opus emits 60 ms bursts (1440 samples
		 * at 24 kHz); u-law interpolation carries 3 at a time. */
		static int16_t pending_pcm[PENDANT_OPUS_REPLY_FRAME_SAMPLES];
		size_t pending_length = 0U;
		size_t pending_offset = 0U;
		int16_t previous_sample = 0;
		size_t prebuffer_bytes =
			opus_reply ? INLINE_OPUS_PREBUFFER_BYTES
				   : INLINE_PREBUFFER_BYTES;
		bool reply_eof = false;
		int stream_error = 0;

		if (opus_reply) {
			int decoder_bytes = pendant_opus_reply_decoder_begin(
				audio_workspace, sizeof(audio_workspace));

			if (decoder_bytes < 0) {
				error = decoder_bytes;
				goto teardown;
			}
			ring = audio_workspace +
			       ROUND_UP((size_t)decoder_bytes, 4U);
			ring_capacity = sizeof(audio_workspace) -
					ROUND_UP((size_t)decoder_bytes, 4U);
		}

		(void)pendant_cloud_reply_set_nonblocking(true);

		for (;;) {
			/* 1) Drain LTE into the jitter ring (non-blocking). */
			while (!reply_eof && ring_count < ring_capacity) {
				uint8_t chunk[512];
				size_t want = MIN(sizeof(chunk),
						  ring_capacity - ring_count);

				read_result =
					pendant_cloud_reply_read(chunk, want);
				if (read_result == -EAGAIN) {
					break;
				}
				if (read_result <= 0) {
					reply_eof = true;
					stream_error = read_result;
					break;
				}
				for (int i = 0; i < read_result; ++i) {
					ring[ring_head] = chunk[i];
					ring_head = (ring_head + 1U) %
						    ring_capacity;
				}
				ring_count += (size_t)read_result;
				if ((size_t)read_result < want) {
					break;
				}
			}

			bool producer_ready;

			if (opus_reply) {
				/* A block can start when decoded samples are
				 * staged or a complete packet is buffered. */
				size_t need = 2U;

				if (ring_count >= 2U) {
					need = 2U +
					       (((size_t)ring[ring_tail] << 8) |
						ring[(ring_tail + 1U) %
						     ring_capacity]);
				}
				producer_ready =
					pending_length > pending_offset ||
					(ring_count >= need && need > 2U);
			} else {
				producer_ready =
					pending_length > pending_offset ||
					ring_count > 0U;
			}

			/* 2) Start gate: prebuffer before spinning I2S up. */
			if (!configured) {
				if (!producer_ready && reply_eof) {
					break;
				}
				if (ring_count < prebuffer_bytes &&
				    !reply_eof) {
					++rebuffer_waits;
					k_msleep(5);
					continue;
				}
				error = i2s_configure(i2s, I2S_DIR_TX, &config);
				if (error == 0) {
					error = queue_i2s_stream_preamble(i2s);
				}
				if (error != 0) {
					break;
				}
				configured = true;
				started = false;
				queued_blocks = I2S_SYNC_PATTERN_BLOCKS + 1U;
			}

			/* 3) Emit one full block when data is ready. */
			if (producer_ready || (reply_eof && ring_count > 0U)) {
				void *block;
				int16_t *output;
				size_t frame = 0U;

				error = k_mem_slab_alloc(&i2s_slab, &block,
							 K_MSEC(3000));
				if (error != 0) {
					break;
				}
				output = block;
				while (frame < I2S_BLOCK_FRAMES) {
					int16_t sample_value;

					if (pending_offset >= pending_length) {
						pending_offset = 0U;
						pending_length = 0U;
						if (opus_reply) {
							int got = inline_opus_next_packet(
								ring,
								ring_capacity,
								&ring_tail,
								&ring_count,
								pending_pcm);

							if (got < 0) {
								stream_error =
									got;
								reply_eof =
									true;
								break;
							}
							if (got == 0) {
								break;
							}
							pending_length =
								(size_t)got;
						} else {
							if (ring_count == 0U) {
								break;
							}
							uint8_t code =
								ring[ring_tail];

							ring_tail =
								(ring_tail +
								 1U) %
								ring_capacity;
							--ring_count;

							int16_t decoded =
								ulaw_to_linear(
									code);
							int32_t delta =
								(int32_t)decoded -
								previous_sample;

							pending_pcm[0] = (int16_t)(previous_sample +
										   delta / 3);
							pending_pcm[1] =
								(int16_t)(previous_sample +
									  (2 * delta) /
										  3);
							pending_pcm[2] = decoded;
							pending_length = 3U;
							previous_sample =
								decoded;
						}
						if (pending_length == 0U) {
							break;
						}
					}
					sample_value =
						pending_pcm[pending_offset++];
					output[2U * frame] = sample_value;
					output[2U * frame + 1U] = sample_value;
					++frame;
				}
				if (frame == 0U) {
					k_mem_slab_free(&i2s_slab, block);
					if (reply_eof) {
						break;
					}
					++rebuffer_waits;
					k_msleep(3);
					continue;
				}
				/* Zero-fill ONLY the final partial block. */
				for (size_t rest = frame;
				     rest < I2S_BLOCK_FRAMES; ++rest) {
					output[2U * rest] = 0;
					output[2U * rest + 1U] = 0;
				}
				error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
				if (error != 0) {
					k_mem_slab_free(&i2s_slab, block);
					if (++recoveries >
					    INLINE_REPLY_MAX_RECOVERIES) {
						break;
					}
					prebuffer_bytes = MIN(
						prebuffer_bytes +
							(opus_reply
								 ? INLINE_OPUS_REBUFFER_STEP
								 : INLINE_REBUFFER_STEP_BYTES),
						ring_capacity / 2U);
					printk("Inline reply starved; pause+rebuffer %u (error %d, next threshold %u)\n",
					       recoveries, error,
					       (unsigned int)prebuffer_bytes);
					(void)i2s_trigger(i2s, I2S_DIR_TX,
							  I2S_TRIGGER_DROP);
					configured = false;
					error = 0;
					continue;
				}
				played_samples += (uint32_t)frame;
				++queued_blocks;
				if (!started &&
				    queued_blocks >= I2S_PREFILL_BLOCKS) {
					error = i2s_trigger(i2s, I2S_DIR_TX,
							    I2S_TRIGGER_START);
					if (error != 0) {
						break;
					}
					started = true;
				}
				if (reply_eof && ring_count == 0U &&
				    pending_offset >= pending_length) {
					break;
				}
				continue;
			}
			if (reply_eof) {
				break;
			}
			/* Mid-play buffer low: keep draining the socket. */
			++rebuffer_waits;
			k_msleep(3);
		}
		if (opus_reply) {
			pendant_opus_reply_decoder_end();
		}
		if (error == 0 && stream_error != 0 &&
		    stream_error != -EAGAIN && played_samples == 0U) {
			read_result = stream_error;
		}
	}

teardown:
	if (configured) {
		bool drained = false;

		if (!started && error == 0 &&
		    i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_START) == 0) {
			started = true;
		}
		if (started && error == 0) {
			drained = i2s_trigger(i2s, I2S_DIR_TX,
					      I2S_TRIGGER_DRAIN) == 0;
		}
		if (!drained) {
			/* An underrun after the final write parks the driver in
			 * ERROR, where DRAIN/START fail; DROP is the only reset
			 * back to READY. Without it every later record/playback
			 * cycle fails until power cycle. */
			(void)i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DROP);
		}
	}

