agenticaiuw/hivemind/firmware/nrf9160/src/main.c
			magnitude = (uint32_t)(value < 0 ? -value : value);
			if (magnitude > convo_tx_peak) {
				convo_tx_peak = magnitude;
			}
		}
		words[frame] = value << 8;

		tx_phase += TX_RESAMPLE_NUM;
		if (tx_phase >= TX_RESAMPLE_DEN) {
			tx_phase -= TX_RESAMPLE_DEN;
			if (*playing && dl_jitter_fill() > 0U) {
				tx_fir_push(dl_jitter[dl_jitter_tail]);
				dl_jitter_tail = (dl_jitter_tail + 1U) %
						 DL_JITTER_SAMPLES;
				convo_tx_dry = false;
			} else {
				tx_fir_push(0);
				if (*playing && !convo_tx_dry) {
					convo_tx_dry = true;
					++convo_tx_starved;
				}
			}
		}
	}
}

/*
 * Keep the TX runway as full as the slab allows. Called once per RX block,
 * but deliberately NOT 1:1 — it writes as many blocks as the driver will
 * accept right now, so the queue stays deep and a late iteration cannot
 * starve the transfer. K_NO_WAIT everywhere: when the driver is saturated
 * (the healthy steady state) there is simply nothing to do.
 */
static int convo_top_up_tx(const struct device *i2s, bool *playing);

/*
 * Audio thread: the ONLY code with an I2S deadline. Reads each RX block and
 * hands the pointer to main (no copy), keeps the TX runway full, and
 * services barge-in flushes. No codec, no socket, no allocation beyond the
 * slabs — so it cannot miss the driver's one-block deadline no matter how
 * long an Opus frame takes on main.
 */
static void audio_thread_fn(void *a, void *b, void *c)
{
	bool playing = false;

	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	for (;;) {
		void *block;
		size_t size;
		int error;

		if (!atomic_get(&convo_active)) {
			playing = false;
			k_msleep(20);
			continue;
		}

		error = i2s_read(audio_i2s_dev, &block, &size);
		if (error != 0) {
			if (atomic_get(&convo_active)) {
				printk("Audio thread I2S read failed: %d\n",
				       error);
				atomic_set(&audio_thread_error, error);
				atomic_set(&convo_end_req, 1);
				atomic_set(&convo_active, 0);
			}
			continue;
		}
		++convo_rx_blocks;

		/* Barge-in: the consumer owns the tail, so dropping the
		 * backlog here is race-free against main's decode. */
		if (atomic_cas(&convo_flush_req, 1, 0)) {
			dl_jitter_tail = dl_jitter_head;
			tx_resample_reset();
			playing = false;
		}

		error = convo_top_up_tx(audio_i2s_dev, &playing);
		if (error != 0) {
			printk("Audio thread TX write failed: %d\n", error);
			atomic_set(&audio_thread_error, error);
			atomic_set(&convo_end_req, 1);
			atomic_set(&convo_active, 0);
		}

		if (k_msgq_put(&mic_raw_q, &block, K_NO_WAIT) != 0) {
			/* Main is behind (long encode): drop this mic block
			 * rather than let the RX queue overflow and take the
			 * whole duplex transfer down with it. */
			k_mem_slab_free(&mic_rx_slab, block);
			++convo_mic_drops;
		}
	}
}

static int convo_top_up_tx(const struct device *i2s, bool *playing)
{
	for (;;) {
		void *block;
		int error;

		if (k_mem_slab_alloc(&convo_tx_slab, &block, K_NO_WAIT) != 0) {
			/* Every block is with the driver: runway is full. */
			return 0;
		}
		convo_fill_tx_block((int32_t *)block, playing);
		error = i2s_write(i2s, block,
				  CONVO_TX_BLOCK_FRAMES * sizeof(int32_t));
		if (error != 0) {
			k_mem_slab_free(&convo_tx_slab, block);
			if (error == -EAGAIN || error == -ENOMSG) {
				/* tx_queue full — runway is full, not an
				 * error (i2s_write's own timeout path). */
				return 0;
			}
			return error;
		}
		++convo_tx_blocks;
	}
}

/*
 * The ESP32 hunts a sync preamble after every BCLK restart: ≥8 alternating
 * 0x2468/0x5A5A words then 0x6C6C, all in the top 16 bits of left-slot
 * words. Block 0 is pure alternation (20.5 ms — outlives the ESP32's
 * discarded first DMA block), block 1 opens with the end marker.
 */
static int convo_queue_preamble(const struct device *i2s)
{
	for (unsigned int block_index = 0U;
	     block_index < CONVO_TX_PRIME_BLOCKS; ++block_index) {
		void *block;
		int32_t *words;
		int error;

		error = k_mem_slab_alloc(&convo_tx_slab, &block, K_MSEC(100));
		if (error != 0) {
			return error;
		}
		++convo_tx_blocks;
		words = (int32_t *)block;
		for (size_t frame = 0U; frame < CONVO_TX_BLOCK_FRAMES;
		     ++frame) {
			int32_t value = 0;

			if (block_index == 0U) {
				value = (frame & 1U) ? I2S_STREAM_SYNC_B
						     : I2S_STREAM_SYNC_A;
			} else if (block_index == 1U &&
				   frame < I2S_SYNC_END_FRAMES) {
				/*
				 * End marker belongs to block 1 ONLY. Without
				 * the block test every priming block repeated
				 * it, and the receiver skips markers only
				 * until it locks — so blocks 2..5 arrived as
				 * audio: four bursts of 0x6C6C (27756, ~85%
				 * of full scale) at 20 ms intervals, i.e. a
				 * burst of loud clicks at the start of every
				 * single conversation. Captured off the wire
				 * at indices 1257-1304 of a press.
				 */
				value = I2S_STREAM_SYNC_END;
			}
			words[frame] = value << 8;
		}
		error = i2s_write(i2s, block,
				  CONVO_TX_BLOCK_FRAMES * sizeof(int32_t));
		if (error != 0) {
			k_mem_slab_free(&convo_tx_slab, block);
			return error;
		}
	}
	return 0;
}

/*
 * WS I/O thread body. All socket work lives here so a stalled modem send
 * can never starve the audio loop's 20 ms TX deadline.
 *
 * Uplink: consume the SPSC wire FIFO, batch, send (blocking is fine on
 * this thread — SO_SNDTIMEO bounds it). Downlink: receive one message at a
 * time; binary frames go into dl_pipe as [2-byte BE frame length][bytes]
 * only when the pipe has room (backpressure = stop receiving, TCP holds
 * the rest); control frames become atomic flags. While no conversation is
 * active the thread just keeps the idle socket alive with pings.
 */
static void ws_io_pump_uplink(void)
{
	uint8_t staging[WS_TX_BATCH_BYTES];
	uint8_t *storage = live_fifo_storage();
	size_t fill;

	while ((fill = live_fifo_fill()) >= WS_TX_BATCH_BYTES ||
	       (live_tx_flush && fill > 0U)) {
		size_t tail = live_fifo_tail;
		size_t batch = MIN(fill, sizeof(staging));

		for (size_t i = 0U; i < batch; ++i) {
			staging[i] =
				storage[(tail + i) % OPUS_TX_FIFO_BYTES];
		}
		if (pendant_ws_send_binary(staging, batch) != 0) {
			atomic_set(&convo_end_req, 1);
			return;
		}
		live_fifo_tail = (tail + batch) % OPUS_TX_FIFO_BYTES;
	}
}

