agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static void ws_io_drain_downlink(void)
{
	for (unsigned int budget = 0U; budget < 4U; ++budget) {
		bool is_text = false;
		int received;

		/* Backpressure: no free slot → stop reading the socket and
		 * let TCP flow control park the rest at the relay. */
		if (k_msgq_num_free_get(&dl_frames) == 0U) {
			return;
		}
		received = pendant_ws_recv(ws_rx_buf, sizeof(ws_rx_buf),
					   &is_text);
		if (received == 0) {
			return;
		}
		if (received < 0) {
			atomic_set(&convo_end_req, 1);
			return;
		}
		if (is_text) {
			ws_rx_buf[MIN((size_t)received,
				      sizeof(ws_rx_buf) - 1U)] = '\0';
			if (strstr((const char *)ws_rx_buf,
				   "\"started\"") != NULL) {
				atomic_set(&convo_started, 1);
			} else if (strstr((const char *)ws_rx_buf,
					  "\"flush\"") != NULL) {
				if (atomic_get(&convo_started)) {
					atomic_set(&convo_flush_req, 1);
				}
			} else if (strstr((const char *)ws_rx_buf,
					  "\"end\"") != NULL) {
				if (atomic_get(&convo_started)) {
					atomic_set(&convo_end_req, 1);
				}
			}
			continue;
		}
		/* Reply audio from the previous conversation: discard. */
		if (!atomic_get(&convo_started)) {
			continue;
		}
		dl_tx_frame.length = (uint16_t)received;
		memcpy(dl_tx_frame.data, ws_rx_buf, (size_t)received);
		(void)k_msgq_put(&dl_frames, &dl_tx_frame, K_NO_WAIT);
	}
}

static void ws_io_thread_fn(void *a, void *b, void *c)
{
	int64_t next_idle_ping = 0;

	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	for (;;) {
		if (atomic_get(&convo_active)) {
			k_mutex_lock(&ws_lock, K_FOREVER);
			if (pendant_ws_connected()) {
				ws_io_pump_uplink();
				ws_io_drain_downlink();
			} else {
				atomic_set(&convo_end_req, 1);
			}
			k_mutex_unlock(&ws_lock);
			k_msleep(5);
			continue;
		}
		if (pendant_ws_connected()) {
			k_mutex_lock(&ws_lock, K_FOREVER);
			if (k_uptime_get() >= next_idle_ping) {
				(void)pendant_ws_ping();
				next_idle_ping = k_uptime_get() +
						 WS_IDLE_PING_SECONDS * 1000;
			}
			/* Swallow pongs and the previous conversation's
			 * trailing frames every tick, not just at ping
			 * time, so none of it leads the next conversation. */
			for (int drained = 1; drained > 0;) {
				bool is_text = false;

				drained = pendant_ws_recv(ws_rx_buf,
							  sizeof(ws_rx_buf),
							  &is_text);
			}
			k_mutex_unlock(&ws_lock);
		}
		k_msleep(200);
	}
}

/*
 * Main-loop side of the downlink: pull whole frames from dl_pipe, decode
 * each packet into the jitter ring. Called between I2S blocks; bounded by
 * ring space, not time (a 60 ms decode is ~2-4 ms here).
 */
static void convo_decode_downlink(void)
{
	unsigned int decodes = 0U;

	while (decodes < CONVO_MAX_DECODES_PER_BLOCK) {
		size_t frame_bytes;
		size_t offset = 0U;

		if (DL_JITTER_SAMPLES - 1U - dl_jitter_fill() <
		    DL_WORST_FRAME_SAMPLES) {
			return;
		}
		if (k_msgq_get(&dl_frames, &dl_rx_frame, K_NO_WAIT) != 0) {
			return;
		}
		frame_bytes = dl_rx_frame.length;

		while (offset + 2U <= frame_bytes) {
			size_t packet_bytes =
				((size_t)dl_rx_frame.data[offset] << 8) |
				dl_rx_frame.data[offset + 1U];

			offset += 2U;
			if (packet_bytes == 0U ||
			    offset + packet_bytes > frame_bytes) {
				printk("Downlink framing broken (len=%u)\n",
				       (unsigned int)packet_bytes);
				atomic_set(&convo_end_req, 1);
				return;
			}
			uint32_t decode_started = k_cycle_get_32();
			int decoded = pendant_opus_reply_decode_packet(
				dl_rx_frame.data + offset, packet_bytes,
				dl_decode_buf, ARRAY_SIZE(dl_decode_buf));
			uint32_t decode_elapsed =
				k_cycle_get_32() - decode_started;

			convo_decode_cycles += decode_elapsed;
			++convo_decode_calls;
			if (decode_elapsed > convo_decode_max_cycles) {
				convo_decode_max_cycles = decode_elapsed;
			}

			if (decoded > 0) {
				dl_jitter_put(dl_decode_buf,
					      (size_t)decoded);
				++convo_decoded_packets;
			}
			offset += packet_bytes;
			++decodes;
		}
	}
}

/*
 * One press-to-press conversation: mic streams up, agent speech streams
 * down and PLAYS WHILE RECORDING — the model decides when to talk. Ends on
 * the second button press, relay 'end' (30 s of mutual silence), transport
 * death, or the runaway cap.
 */
static int run_conversation(const struct device *i2s)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	struct i2s_config tx_config;
	int32_t raw_processing[MIC_RX_BLOCK_FRAMES];
	char device_time[32];
	char start_message[96];
	int64_t started_at;
	int64_t next_led_toggle;
	size_t stage_frames = 0U;
	size_t block_index = 0U;
	int32_t hpf_prev_in = 0;
	int32_t hpf_prev_out = 0;
	bool hpf_primed = false;
	int32_t slew_prev = 0;
	bool slew_primed = false;
	bool playing = false;
	bool i2s_running = false;
	bool stop_sent = false;
	int result = 0;
	int error;

	live_stream_failed = false;
	live_tx_saturated = false;
	live_fifo_reset();
	dl_jitter_reset();
	tx_resample_reset();
	k_msgq_purge(&dl_frames);
	atomic_set(&convo_flush_req, 0);
	atomic_set(&convo_end_req, 0);
	atomic_set(&convo_started, 0);
	convo_tx_blocks = 0U;
	convo_tx_starved = 0U;
	convo_tx_dry = false;
	convo_rx_blocks = 0U;
	convo_decoded_packets = 0U;
	convo_max_loop_ms = 0U;
	convo_uplink_drops = 0U;
	convo_mic_drops = 0U;
	convo_tx_peak = 0U;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/* Per-conversation, like every other counter here. Head/tail are
	 * deliberately untouched: the host prefills the ring before pressing,
	 * and resetting the indices here would throw that prefill away. */
	pendant_inject_frames = 0U;
	pendant_inject_underruns = 0U;
#endif
	convo_uplink_ducked = false;
	convo_uplink_holding = false;
	convo_dl_active_until = 0;
	convo_adapt_last_ms = 0;
	convo_uplink_duck_ms = 0U;
	convo_uplink_held = 0U;
	convo_decode_cycles = 0U;
	convo_decode_calls = 0U;
	convo_decode_max_cycles = 0U;
	convo_encode_cycles = 0U;
	convo_encode_calls = 0U;
	convo_encode_max_cycles = 0U;

	k_mutex_lock(&ws_lock, K_FOREVER);
	error = pendant_ws_connect();
	if (error == 0) {
		pendant_cloud_copy_device_time(device_time,
					       sizeof(device_time));
		snprintf(start_message, sizeof(start_message),
			 "{\"type\":\"start\",\"deviceTime\":\"%s\"}",
			 device_time);
		error = pendant_ws_send_text(start_message);
	}
	k_mutex_unlock(&ws_lock);
	if (error != 0) {
		return error;
	}

	error = pendant_opus_stream_begin_packets(SAMPLE_RATE,
						  audio_workspace,
						  OPUS_TX_ARENA_BYTES,
						  live_opus_packet_sink);
	if (error != 0) {
		printk("Conversation encoder init failed: %d\n", error);
		return error;
	}
	error = pendant_opus_reply_decoder_begin_rate(
		opus_dec_arena, sizeof(opus_dec_arena),
		PENDANT_OPUS_REPLY_SAMPLE_RATE);
	if (error < 0) {
		printk("Conversation decoder init failed: %d\n", error);
		pendant_opus_stream_abort();
		return error;
	}

	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		goto teardown;
	}

	gpio_pin_set_dt(&led, 1);
	next_led_toggle = k_uptime_get() + 250;
	mic_clocks_start();

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error != 0) {
		goto teardown_clocks;
	}
	tx_config = config;
	tx_config.mem_slab = &convo_tx_slab;
	/*
	 * TX writes must NEVER block. i2s_write waits up to cfg.timeout for
	 * a free tx_queue slot, which paces the loop to exactly one RX block
	 * per block period — leaving no way to drain an RX backlog after a
	 * stall, so the backlog grows until the RX queue overflows and the
	 * driver errors the transfer (observed as -EIO at ~15 s). With 0 the
	 * top-up simply stops when the runway is full and the loop is free
	 * to catch up. RX keeps its own timeout for i2s_read.
	 */
	tx_config.timeout = 0;
	error = i2s_configure(i2s, I2S_DIR_TX, &tx_config);
	if (error != 0) {
		goto teardown_clocks;
	}

	/* START in BOTH mode needs TX blocks queued first. */
	error = convo_queue_preamble(i2s);
	if (error != 0) {
		goto teardown_clocks;
	}

